;;; packages.el -*- lexical-binding: t; -*-

;; Package list generated by nix-doom-emacs-unstraightened.

;; Disabled packages:
(package! evil-escape :disable t)

;; Packages installed by nix-doom-emacs-unstraightened or ignored by you:
(package! auto-minor-mode :ignore t)
(package! use-package :ignore t)
(package! better-jumper :ignore t)
(package! general :ignore t)
(package! projectile :ignore t)
(package! smartparens :ignore t)
(package! compat :ignore t)
(package! gcmh :ignore t)
(package! straight :ignore t)
(package! nerd-icons :ignore t)
(package! project :ignore t)
(package! which-key :ignore t)
(package! vertico :ignore t)
(package! orderless :ignore t)
(package! consult :ignore t)
(package! consult-dir :ignore t)
(package! embark :ignore t)
(package! embark-consult :ignore t)
(package! marginalia :ignore t)
(package! wgrep :ignore t)
(package! doom-themes :ignore t)
(package! solaire-mode :ignore t)
(package! doom-modeline :ignore t)
(package! anzu :ignore t)
(package! evil-anzu :ignore t)
(package! nav-flash :ignore t)
(package! evil-goggles :ignore t)
(package! ace-window :ignore t)
(package! evil :ignore t)
(package! evil-args :ignore t)
(package! evil-easymotion :ignore t)
(package! evil-embrace :ignore t)
(package! evil-exchange :ignore t)
(package! evil-indent-plus :ignore t)
(package! evil-lion :ignore t)
(package! evil-nerd-commenter :ignore t)
(package! evil-numbers :ignore t)
(package! evil-snipe :ignore t)
(package! evil-surround :ignore t)
(package! evil-textobj-anyblock :ignore t)
(package! evil-traces :ignore t)
(package! evil-visualstar :ignore t)
(package! exato :ignore t)
(package! evil-quick-diff :ignore t)
(package! undo-fu :ignore t)
(package! undo-fu-session :ignore t)
(package! vundo :ignore t)
(package! eshell-up :ignore t)
(package! eshell-z :ignore t)
(package! shrink-path :ignore t)
(package! esh-help :ignore t)
(package! eshell-did-you-mean :ignore t)
(package! eshell-syntax-highlighting :ignore t)
(package! pcmpl-args :ignore t)
(package! vterm :ignore t)
(package! clipetty :ignore t)
(package! evil-terminal-cursor-changer :ignore t)
(package! kkp :ignore t)
(package! elisp-mode :ignore t)
(package! highlight-quoted :ignore t)
(package! helpful :ignore t)
(package! macrostep :ignore t)
(package! overseer :ignore t)
(package! elisp-def :ignore t)
(package! elisp-demos :ignore t)
(package! let-completion :ignore t)
(package! buttercup :ignore t)
(package! nix-mode :ignore t)
(package! nix-update :ignore t)
(package! nixos-options :ignore t)
(package! nix-ts-mode :ignore t)
(package! org :ignore t)
(package! org-contrib :ignore t)
(package! avy :ignore t)
(package! htmlize :ignore t)
(package! ox-clip :ignore t)
(package! toc-org :ignore t)
(package! org-cliplink :ignore t)
(package! org-modern :ignore t)
(package! org-appear :ignore t)
(package! ob-async :ignore t)
(package! markdown-mode :ignore t)
(package! markdown-toc :ignore t)
(package! edit-indirect :ignore t)
(package! nodejs-repl :ignore t)
(package! emmet-mode :ignore t)
(package! haml-mode :ignore t)
(package! pug-mode :ignore t)
(package! slim-mode :ignore t)
(package! web-mode :ignore t)
(package! css-mode :ignore t)
(package! less-css-mode :ignore t)
(package! sass-mode :ignore t)
(package! stylus-mode :ignore t)
(package! sws-mode :ignore t)
(package! rainbow-mode :ignore t)
(package! json-mode :ignore t)
(package! json-snatcher :ignore t)
(package! yaml-mode :ignore t)
(package! eglot :ignore t)
(package! jsonrpc :ignore t)
(package! consult-eglot :ignore t)
(package! link-hint :ignore t)
(package! dotenv-mode :ignore t)
